MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/isi.h
/*
 * Component description for ISI
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-04-15T17:35:10Z  */
#ifndef _PIC32CZMC70_ISI_COMPONENT_H_
#define _PIC32CZMC70_ISI_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR ISI                       */
/* ************************************************************************** */

/* -------- ISI_CFG1 : (ISI Offset: 0x00) (R/W 32) ISI Configuration 1 Register -------- */
#define ISI_CFG1_HSYNC_POL_Pos                _UINT32_(2)                                          /* (ISI_CFG1) Horizontal Synchronization Polarity Position */
#define ISI_CFG1_HSYNC_POL_Msk                (_UINT32_(0x1) << ISI_CFG1_HSYNC_POL_Pos)            /* (ISI_CFG1) Horizontal Synchronization Polarity Mask */
#define ISI_CFG1_HSYNC_POL(value)             (ISI_CFG1_HSYNC_POL_Msk & (_UINT32_(value) << ISI_CFG1_HSYNC_POL_Pos)) /* Assignment of value for HSYNC_POL in the ISI_CFG1 register */
#define ISI_CFG1_VSYNC_POL_Pos                _UINT32_(3)                                          /* (ISI_CFG1) Vertical Synchronization Polarity Position */
#define ISI_CFG1_VSYNC_POL_Msk                (_UINT32_(0x1) << ISI_CFG1_VSYNC_POL_Pos)            /* (ISI_CFG1) Vertical Synchronization Polarity Mask */
#define ISI_CFG1_VSYNC_POL(value)             (ISI_CFG1_VSYNC_POL_Msk & (_UINT32_(value) << ISI_CFG1_VSYNC_POL_Pos)) /* Assignment of value for VSYNC_POL in the ISI_CFG1 register */
#define ISI_CFG1_PIXCLK_POL_Pos               _UINT32_(4)                                          /* (ISI_CFG1) Pixel Clock Polarity Position */
#define ISI_CFG1_PIXCLK_POL_Msk               (_UINT32_(0x1) << ISI_CFG1_PIXCLK_POL_Pos)           /* (ISI_CFG1) Pixel Clock Polarity Mask */
#define ISI_CFG1_PIXCLK_POL(value)            (ISI_CFG1_PIXCLK_POL_Msk & (_UINT32_(value) << ISI_CFG1_PIXCLK_POL_Pos)) /* Assignment of value for PIXCLK_POL in the ISI_CFG1 register */
#define ISI_CFG1_GRAYLE_Pos                   _UINT32_(5)                                          /* (ISI_CFG1) Grayscale Little Endian Position */
#define ISI_CFG1_GRAYLE_Msk                   (_UINT32_(0x1) << ISI_CFG1_GRAYLE_Pos)               /* (ISI_CFG1) Grayscale Little Endian Mask */
#define ISI_CFG1_GRAYLE(value)                (ISI_CFG1_GRAYLE_Msk & (_UINT32_(value) << ISI_CFG1_GRAYLE_Pos)) /* Assignment of value for GRAYLE in the ISI_CFG1 register */
#define ISI_CFG1_EMB_SYNC_Pos                 _UINT32_(6)                                          /* (ISI_CFG1) Embedded Synchronization Position */
#define ISI_CFG1_EMB_SYNC_Msk                 (_UINT32_(0x1) << ISI_CFG1_EMB_SYNC_Pos)             /* (ISI_CFG1) Embedded Synchronization Mask */
#define ISI_CFG1_EMB_SYNC(value)              (ISI_CFG1_EMB_SYNC_Msk & (_UINT32_(value) << ISI_CFG1_EMB_SYNC_Pos)) /* Assignment of value for EMB_SYNC in the ISI_CFG1 register */
#define ISI_CFG1_CRC_SYNC_Pos                 _UINT32_(7)                                          /* (ISI_CFG1) Embedded Synchronization Correction Position */
#define ISI_CFG1_CRC_SYNC_Msk                 (_UINT32_(0x1) << ISI_CFG1_CRC_SYNC_Pos)             /* (ISI_CFG1) Embedded Synchronization Correction Mask */
#define ISI_CFG1_CRC_SYNC(value)              (ISI_CFG1_CRC_SYNC_Msk & (_UINT32_(value) << ISI_CFG1_CRC_SYNC_Pos)) /* Assignment of value for CRC_SYNC in the ISI_CFG1 register */
#define ISI_CFG1_FRATE_Pos                    _UINT32_(8)                                          /* (ISI_CFG1) Frame Rate [0..7] Position */
#define ISI_CFG1_FRATE_Msk                    (_UINT32_(0x7) << ISI_CFG1_FRATE_Pos)                /* (ISI_CFG1) Frame Rate [0..7] Mask */
#define ISI_CFG1_FRATE(value)                 (ISI_CFG1_FRATE_Msk & (_UINT32_(value) << ISI_CFG1_FRATE_Pos)) /* Assignment of value for FRATE in the ISI_CFG1 register */
#define ISI_CFG1_DISCR_Pos                    _UINT32_(11)                                         /* (ISI_CFG1) Disable Codec Request Position */
#define ISI_CFG1_DISCR_Msk                    (_UINT32_(0x1) << ISI_CFG1_DISCR_Pos)                /* (ISI_CFG1) Disable Codec Request Mask */
#define ISI_CFG1_DISCR(value)                 (ISI_CFG1_DISCR_Msk & (_UINT32_(value) << ISI_CFG1_DISCR_Pos)) /* Assignment of value for DISCR in the ISI_CFG1 register */
#define ISI_CFG1_FULL_Pos                     _UINT32_(12)                                         /* (ISI_CFG1) Full Mode is Allowed Position */
#define ISI_CFG1_FULL_Msk                     (_UINT32_(0x1) << ISI_CFG1_FULL_Pos)                 /* (ISI_CFG1) Full Mode is Allowed Mask */
#define ISI_CFG1_FULL(value)                  (ISI_CFG1_FULL_Msk & (_UINT32_(value) << ISI_CFG1_FULL_Pos)) /* Assignment of value for FULL in the ISI_CFG1 register */
#define ISI_CFG1_THMASK_Pos                   _UINT32_(13)                                         /* (ISI_CFG1) Threshold Mask Position */
#define ISI_CFG1_THMASK_Msk                   (_UINT32_(0x3) << ISI_CFG1_THMASK_Pos)               /* (ISI_CFG1) Threshold Mask Mask */
#define ISI_CFG1_THMASK(value)                (ISI_CFG1_THMASK_Msk & (_UINT32_(value) << ISI_CFG1_THMASK_Pos)) /* Assignment of value for THMASK in the ISI_CFG1 register */
#define   ISI_CFG1_THMASK_BEATS_4_Val         _UINT32_(0x0)                                        /* (ISI_CFG1) Only 4 beats AHB burst allowed  */
#define   ISI_CFG1_THMASK_BEATS_8_Val         _UINT32_(0x1)                                        /* (ISI_CFG1) Only 4 and 8 beats AHB burst allowed  */
#define   ISI_CFG1_THMASK_BEATS_16_Val        _UINT32_(0x2)                                        /* (ISI_CFG1) 4, 8 and 16 beats AHB burst allowed  */
#define ISI_CFG1_THMASK_BEATS_4               (ISI_CFG1_THMASK_BEATS_4_Val << ISI_CFG1_THMASK_Pos) /* (ISI_CFG1) Only 4 beats AHB burst allowed Position */
#define ISI_CFG1_THMASK_BEATS_8               (ISI_CFG1_THMASK_BEATS_8_Val << ISI_CFG1_THMASK_Pos) /* (ISI_CFG1) Only 4 and 8 beats AHB burst allowed Position */
#define ISI_CFG1_THMASK_BEATS_16              (ISI_CFG1_THMASK_BEATS_16_Val << ISI_CFG1_THMASK_Pos) /* (ISI_CFG1) 4, 8 and 16 beats AHB burst allowed Position */
#define ISI_CFG1_SLD_Pos                      _UINT32_(16)                                         /* (ISI_CFG1) Start of Line Delay Position */
#define ISI_CFG1_SLD_Msk                      (_UINT32_(0xFF) << ISI_CFG1_SLD_Pos)                 /* (ISI_CFG1) Start of Line Delay Mask */
#define ISI_CFG1_SLD(value)                   (ISI_CFG1_SLD_Msk & (_UINT32_(value) << ISI_CFG1_SLD_Pos)) /* Assignment of value for SLD in the ISI_CFG1 register */
#define ISI_CFG1_SFD_Pos                      _UINT32_(24)                                         /* (ISI_CFG1) Start of Frame Delay Position */
#define ISI_CFG1_SFD_Msk                      (_UINT32_(0xFF) << ISI_CFG1_SFD_Pos)                 /* (ISI_CFG1) Start of Frame Delay Mask */
#define ISI_CFG1_SFD(value)                   (ISI_CFG1_SFD_Msk & (_UINT32_(value) << ISI_CFG1_SFD_Pos)) /* Assignment of value for SFD in the ISI_CFG1 register */
#define ISI_CFG1_Msk                          _UINT32_(0xFFFF7FFC)                                 /* (ISI_CFG1) Register Mask  */


/* -------- ISI_CFG2 : (ISI Offset: 0x04) (R/W 32) ISI Configuration 2 Register -------- */
#define ISI_CFG2_IM_VSIZE_Pos                 _UINT32_(0)                                          /* (ISI_CFG2) Vertical Size of the Image Sensor [0..2047] Position */
#define ISI_CFG2_IM_VSIZE_Msk                 (_UINT32_(0x7FF) << ISI_CFG2_IM_VSIZE_Pos)           /* (ISI_CFG2) Vertical Size of the Image Sensor [0..2047] Mask */
#define ISI_CFG2_IM_VSIZE(value)              (ISI_CFG2_IM_VSIZE_Msk & (_UINT32_(value) << ISI_CFG2_IM_VSIZE_Pos)) /* Assignment of value for IM_VSIZE in the ISI_CFG2 register */
#define ISI_CFG2_GS_MODE_Pos                  _UINT32_(11)                                         /* (ISI_CFG2) Grayscale Pixel Format Mode Position */
#define ISI_CFG2_GS_MODE_Msk                  (_UINT32_(0x1) << ISI_CFG2_GS_MODE_Pos)              /* (ISI_CFG2) Grayscale Pixel Format Mode Mask */
#define ISI_CFG2_GS_MODE(value)               (ISI_CFG2_GS_MODE_Msk & (_UINT32_(value) << ISI_CFG2_GS_MODE_Pos)) /* Assignment of value for GS_MODE in the ISI_CFG2 register */
#define ISI_CFG2_RGB_MODE_Pos                 _UINT32_(12)                                         /* (ISI_CFG2) RGB Input Mode Position */
#define ISI_CFG2_RGB_MODE_Msk                 (_UINT32_(0x1) << ISI_CFG2_RGB_MODE_Pos)             /* (ISI_CFG2) RGB Input Mode Mask */
#define ISI_CFG2_RGB_MODE(value)              (ISI_CFG2_RGB_MODE_Msk & (_UINT32_(value) << ISI_CFG2_RGB_MODE_Pos)) /* Assignment of value for RGB_MODE in the ISI_CFG2 register */
#define ISI_CFG2_GRAYSCALE_Pos                _UINT32_(13)                                         /* (ISI_CFG2) Grayscale Mode Format Enable Position */
#define ISI_CFG2_GRAYSCALE_Msk                (_UINT32_(0x1) << ISI_CFG2_GRAYSCALE_Pos)            /* (ISI_CFG2) Grayscale Mode Format Enable Mask */
#define ISI_CFG2_GRAYSCALE(value)             (ISI_CFG2_GRAYSCALE_Msk & (_UINT32_(value) << ISI_CFG2_GRAYSCALE_Pos)) /* Assignment of value for GRAYSCALE in the ISI_CFG2 register */
#define ISI_CFG2_RGB_SWAP_Pos                 _UINT32_(14)                                         /* (ISI_CFG2) RGB Format Swap Mode Position */
#define ISI_CFG2_RGB_SWAP_Msk                 (_UINT32_(0x1) << ISI_CFG2_RGB_SWAP_Pos)             /* (ISI_CFG2) RGB Format Swap Mode Mask */
#define ISI_CFG2_RGB_SWAP(value)              (ISI_CFG2_RGB_SWAP_Msk & (_UINT32_(value) << ISI_CFG2_RGB_SWAP_Pos)) /* Assignment of value for RGB_SWAP in the ISI_CFG2 register */
#define ISI_CFG2_COL_SPACE_Pos                _UINT32_(15)                                         /* (ISI_CFG2) Color Space for the Image Data Position */
#define ISI_CFG2_COL_SPACE_Msk                (_UINT32_(0x1) << ISI_CFG2_COL_SPACE_Pos)            /* (ISI_CFG2) Color Space for the Image Data Mask */
#define ISI_CFG2_COL_SPACE(value)             (ISI_CFG2_COL_SPACE_Msk & (_UINT32_(value) << ISI_CFG2_COL_SPACE_Pos)) /* Assignment of value for COL_SPACE in the ISI_CFG2 register */
#define ISI_CFG2_IM_HSIZE_Pos                 _UINT32_(16)                                         /* (ISI_CFG2) Horizontal Size of the Image Sensor [0..2047] Position */
#define ISI_CFG2_IM_HSIZE_Msk                 (_UINT32_(0x7FF) << ISI_CFG2_IM_HSIZE_Pos)           /* (ISI_CFG2) Horizontal Size of the Image Sensor [0..2047] Mask */
#define ISI_CFG2_IM_HSIZE(value)              (ISI_CFG2_IM_HSIZE_Msk & (_UINT32_(value) << ISI_CFG2_IM_HSIZE_Pos)) /* Assignment of value for IM_HSIZE in the ISI_CFG2 register */
#define ISI_CFG2_YCC_SWAP_Pos                 _UINT32_(28)                                         /* (ISI_CFG2) YCrCb Format Swap Mode Position */
#define ISI_CFG2_YCC_SWAP_Msk                 (_UINT32_(0x3) << ISI_CFG2_YCC_SWAP_Pos)             /* (ISI_CFG2) YCrCb Format Swap Mode Mask */
#define ISI_CFG2_YCC_SWAP(value)              (ISI_CFG2_YCC_SWAP_Msk & (_UINT32_(value) << ISI_CFG2_YCC_SWAP_Pos)) /* Assignment of value for YCC_SWAP in the ISI_CFG2 register */
#define   ISI_CFG2_YCC_SWAP_DEFAULT_Val       _UINT32_(0x0)                                        /* (ISI_CFG2) Byte 0 Cb(i)Byte 1 Y(i)Byte 2 Cr(i)Byte 3 Y(i+1)  */
#define   ISI_CFG2_YCC_SWAP_MODE1_Val         _UINT32_(0x1)                                        /* (ISI_CFG2) Byte 0 Cr(i)Byte 1 Y(i)Byte 2 Cb(i)Byte 3 Y(i+1)  */
#define   ISI_CFG2_YCC_SWAP_MODE2_Val         _UINT32_(0x2)                                        /* (ISI_CFG2) Byte 0 Y(i)Byte 1 Cb(i)Byte 2 Y(i+1)Byte 3 Cr(i)  */
#define   ISI_CFG2_YCC_SWAP_MODE3_Val         _UINT32_(0x3)                                        /* (ISI_CFG2) Byte 0 Y(i)Byte 1 Cr(i)Byte 2 Y(i+1)Byte 3 Cb(i)  */
#define ISI_CFG2_YCC_SWAP_DEFAULT             (ISI_CFG2_YCC_SWAP_DEFAULT_Val << ISI_CFG2_YCC_SWAP_Pos) /* (ISI_CFG2) Byte 0 Cb(i)Byte 1 Y(i)Byte 2 Cr(i)Byte 3 Y(i+1) Position */
#define ISI_CFG2_YCC_SWAP_MODE1               (ISI_CFG2_YCC_SWAP_MODE1_Val << ISI_CFG2_YCC_SWAP_Pos) /* (ISI_CFG2) Byte 0 Cr(i)Byte 1 Y(i)Byte 2 Cb(i)Byte 3 Y(i+1) Position */
#define ISI_CFG2_YCC_SWAP_MODE2               (ISI_CFG2_YCC_SWAP_MODE2_Val << ISI_CFG2_YCC_SWAP_Pos) /* (ISI_CFG2) Byte 0 Y(i)Byte 1 Cb(i)Byte 2 Y(i+1)Byte 3 Cr(i) Position */
#define ISI_CFG2_YCC_SWAP_MODE3               (ISI_CFG2_YCC_SWAP_MODE3_Val << ISI_CFG2_YCC_SWAP_Pos) /* (ISI_CFG2) Byte 0 Y(i)Byte 1 Cr(i)Byte 2 Y(i+1)Byte 3 Cb(i) Position */
#define ISI_CFG2_RGB_CFG_Pos                  _UINT32_(30)                                         /* (ISI_CFG2) RGB Pixel Mapping Configuration Position */
#define ISI_CFG2_RGB_CFG_Msk                  (_UINT32_(0x3) << ISI_CFG2_RGB_CFG_Pos)              /* (ISI_CFG2) RGB Pixel Mapping Configuration Mask */
#define ISI_CFG2_RGB_CFG(value)               (ISI_CFG2_RGB_CFG_Msk & (_UINT32_(value) << ISI_CFG2_RGB_CFG_Pos)) /* Assignment of value for RGB_CFG in the ISI_CFG2 register */
#define   ISI_CFG2_RGB_CFG_DEFAULT_Val        _UINT32_(0x0)                                        /* (ISI_CFG2) Byte 0 R/G(MSB)Byte 1 G(LSB)/BByte 2 R/G(MSB)Byte 3 G(LSB)/B  */
#define   ISI_CFG2_RGB_CFG_MODE1_Val          _UINT32_(0x1)                                        /* (ISI_CFG2) Byte 0 B/G(MSB)Byte 1 G(LSB)/RByte 2 B/G(MSB)Byte 3 G(LSB)/R  */
#define   ISI_CFG2_RGB_CFG_MODE2_Val          _UINT32_(0x2)                                        /* (ISI_CFG2) Byte 0 G(LSB)/RByte 1 B/G(MSB)Byte 2 G(LSB)/RByte 3 B/G(MSB)  */
#define   ISI_CFG2_RGB_CFG_MODE3_Val          _UINT32_(0x3)                                        /* (ISI_CFG2) Byte 0 G(LSB)/BByte 1 R/G(MSB)Byte 2 G(LSB)/BByte 3 R/G(MSB)  */
#define ISI_CFG2_RGB_CFG_DEFAULT              (ISI_CFG2_RGB_CFG_DEFAULT_Val << ISI_CFG2_RGB_CFG_Pos) /* (ISI_CFG2) Byte 0 R/G(MSB)Byte 1 G(LSB)/BByte 2 R/G(MSB)Byte 3 G(LSB)/B Position */
#define ISI_CFG2_RGB_CFG_MODE1                (ISI_CFG2_RGB_CFG_MODE1_Val << ISI_CFG2_RGB_CFG_Pos) /* (ISI_CFG2) Byte 0 B/G(MSB)Byte 1 G(LSB)/RByte 2 B/G(MSB)Byte 3 G(LSB)/R Position */
#define ISI_CFG2_RGB_CFG_MODE2                (ISI_CFG2_RGB_CFG_MODE2_Val << ISI_CFG2_RGB_CFG_Pos) /* (ISI_CFG2) Byte 0 G(LSB)/RByte 1 B/G(MSB)Byte 2 G(LSB)/RByte 3 B/G(MSB) Position */
#define ISI_CFG2_RGB_CFG_MODE3                (ISI_CFG2_RGB_CFG_MODE3_Val << ISI_CFG2_RGB_CFG_Pos) /* (ISI_CFG2) Byte 0 G(LSB)/BByte 1 R/G(MSB)Byte 2 G(LSB)/BByte 3 R/G(MSB) Position */
#define ISI_CFG2_Msk                          _UINT32_(0xF7FFFFFF)                                 /* (ISI_CFG2) Register Mask  */


/* -------- ISI_PSIZE : (ISI Offset: 0x08) (R/W 32) ISI Preview Size Register -------- */
#define ISI_PSIZE_PREV_VSIZE_Pos              _UINT32_(0)                                          /* (ISI_PSIZE) Vertical Size for the Preview Path Position */
#define ISI_PSIZE_PREV_VSIZE_Msk              (_UINT32_(0x3FF) << ISI_PSIZE_PREV_VSIZE_Pos)        /* (ISI_PSIZE) Vertical Size for the Preview Path Mask */
#define ISI_PSIZE_PREV_VSIZE(value)           (ISI_PSIZE_PREV_VSIZE_Msk & (_UINT32_(value) << ISI_PSIZE_PREV_VSIZE_Pos)) /* Assignment of value for PREV_VSIZE in the ISI_PSIZE register */
#define ISI_PSIZE_PREV_HSIZE_Pos              _UINT32_(16)                                         /* (ISI_PSIZE) Horizontal Size for the Preview Path Position */
#define ISI_PSIZE_PREV_HSIZE_Msk              (_UINT32_(0x3FF) << ISI_PSIZE_PREV_HSIZE_Pos)        /* (ISI_PSIZE) Horizontal Size for the Preview Path Mask */
#define ISI_PSIZE_PREV_HSIZE(value)           (ISI_PSIZE_PREV_HSIZE_Msk & (_UINT32_(value) << ISI_PSIZE_PREV_HSIZE_Pos)) /* Assignment of value for PREV_HSIZE in the ISI_PSIZE register */
#define ISI_PSIZE_Msk                         _UINT32_(0x03FF03FF)                                 /* (ISI_PSIZE) Register Mask  */


/* -------- ISI_PDECF : (ISI Offset: 0x0C) (R/W 32) ISI Preview Decimation Factor Register -------- */
#define ISI_PDECF_DEC_FACTOR_Pos              _UINT32_(0)                                          /* (ISI_PDECF) Decimation Factor Position */
#define ISI_PDECF_DEC_FACTOR_Msk              (_UINT32_(0xFF) << ISI_PDECF_DEC_FACTOR_Pos)         /* (ISI_PDECF) Decimation Factor Mask */
#define ISI_PDECF_DEC_FACTOR(value)           (ISI_PDECF_DEC_FACTOR_Msk & (_UINT32_(value) << ISI_PDECF_DEC_FACTOR_Pos)) /* Assignment of value for DEC_FACTOR in the ISI_PDECF register */
#define ISI_PDECF_Msk                         _UINT32_(0x000000FF)                                 /* (ISI_PDECF) Register Mask  */


