MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/isi.h
/* -------- ISI_Y2R_SET0 : (ISI Offset: 0x10) (R/W 32) ISI Color Space Conversion YCrCb To RGB Set 0 Register -------- */
#define ISI_Y2R_SET0_C0_Pos                   _UINT32_(0)                                          /* (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C0 Position */
#define ISI_Y2R_SET0_C0_Msk                   (_UINT32_(0xFF) << ISI_Y2R_SET0_C0_Pos)              /* (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C0 Mask */
#define ISI_Y2R_SET0_C0(value)                (ISI_Y2R_SET0_C0_Msk & (_UINT32_(value) << ISI_Y2R_SET0_C0_Pos)) /* Assignment of value for C0 in the ISI_Y2R_SET0 register */
#define ISI_Y2R_SET0_C1_Pos                   _UINT32_(8)                                          /* (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C1 Position */
#define ISI_Y2R_SET0_C1_Msk                   (_UINT32_(0xFF) << ISI_Y2R_SET0_C1_Pos)              /* (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C1 Mask */
#define ISI_Y2R_SET0_C1(value)                (ISI_Y2R_SET0_C1_Msk & (_UINT32_(value) << ISI_Y2R_SET0_C1_Pos)) /* Assignment of value for C1 in the ISI_Y2R_SET0 register */
#define ISI_Y2R_SET0_C2_Pos                   _UINT32_(16)                                         /* (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C2 Position */
#define ISI_Y2R_SET0_C2_Msk                   (_UINT32_(0xFF) << ISI_Y2R_SET0_C2_Pos)              /* (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C2 Mask */
#define ISI_Y2R_SET0_C2(value)                (ISI_Y2R_SET0_C2_Msk & (_UINT32_(value) << ISI_Y2R_SET0_C2_Pos)) /* Assignment of value for C2 in the ISI_Y2R_SET0 register */
#define ISI_Y2R_SET0_C3_Pos                   _UINT32_(24)                                         /* (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C3 Position */
#define ISI_Y2R_SET0_C3_Msk                   (_UINT32_(0xFF) << ISI_Y2R_SET0_C3_Pos)              /* (ISI_Y2R_SET0) Color Space Conversion Matrix Coefficient C3 Mask */
#define ISI_Y2R_SET0_C3(value)                (ISI_Y2R_SET0_C3_Msk & (_UINT32_(value) << ISI_Y2R_SET0_C3_Pos)) /* Assignment of value for C3 in the ISI_Y2R_SET0 register */
#define ISI_Y2R_SET0_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ISI_Y2R_SET0) Register Mask  */


/* -------- ISI_Y2R_SET1 : (ISI Offset: 0x14) (R/W 32) ISI Color Space Conversion YCrCb To RGB Set 1 Register -------- */
#define ISI_Y2R_SET1_C4_Pos                   _UINT32_(0)                                          /* (ISI_Y2R_SET1) Color Space Conversion Matrix Coefficient C4 Position */
#define ISI_Y2R_SET1_C4_Msk                   (_UINT32_(0x1FF) << ISI_Y2R_SET1_C4_Pos)             /* (ISI_Y2R_SET1) Color Space Conversion Matrix Coefficient C4 Mask */
#define ISI_Y2R_SET1_C4(value)                (ISI_Y2R_SET1_C4_Msk & (_UINT32_(value) << ISI_Y2R_SET1_C4_Pos)) /* Assignment of value for C4 in the ISI_Y2R_SET1 register */
#define ISI_Y2R_SET1_Yoff_Pos                 _UINT32_(12)                                         /* (ISI_Y2R_SET1) Color Space Conversion Luminance Default Offset Position */
#define ISI_Y2R_SET1_Yoff_Msk                 (_UINT32_(0x1) << ISI_Y2R_SET1_Yoff_Pos)             /* (ISI_Y2R_SET1) Color Space Conversion Luminance Default Offset Mask */
#define ISI_Y2R_SET1_Yoff(value)              (ISI_Y2R_SET1_Yoff_Msk & (_UINT32_(value) << ISI_Y2R_SET1_Yoff_Pos)) /* Assignment of value for Yoff in the ISI_Y2R_SET1 register */
#define ISI_Y2R_SET1_Croff_Pos                _UINT32_(13)                                         /* (ISI_Y2R_SET1) Color Space Conversion Red Chrominance Default Offset Position */
#define ISI_Y2R_SET1_Croff_Msk                (_UINT32_(0x1) << ISI_Y2R_SET1_Croff_Pos)            /* (ISI_Y2R_SET1) Color Space Conversion Red Chrominance Default Offset Mask */
#define ISI_Y2R_SET1_Croff(value)             (ISI_Y2R_SET1_Croff_Msk & (_UINT32_(value) << ISI_Y2R_SET1_Croff_Pos)) /* Assignment of value for Croff in the ISI_Y2R_SET1 register */
#define ISI_Y2R_SET1_Cboff_Pos                _UINT32_(14)                                         /* (ISI_Y2R_SET1) Color Space Conversion Blue Chrominance Default Offset Position */
#define ISI_Y2R_SET1_Cboff_Msk                (_UINT32_(0x1) << ISI_Y2R_SET1_Cboff_Pos)            /* (ISI_Y2R_SET1) Color Space Conversion Blue Chrominance Default Offset Mask */
#define ISI_Y2R_SET1_Cboff(value)             (ISI_Y2R_SET1_Cboff_Msk & (_UINT32_(value) << ISI_Y2R_SET1_Cboff_Pos)) /* Assignment of value for Cboff in the ISI_Y2R_SET1 register */
#define ISI_Y2R_SET1_Msk                      _UINT32_(0x000071FF)                                 /* (ISI_Y2R_SET1) Register Mask  */


/* -------- ISI_R2Y_SET0 : (ISI Offset: 0x18) (R/W 32) ISI Color Space Conversion RGB To YCrCb Set 0 Register -------- */
#define ISI_R2Y_SET0_C0_Pos                   _UINT32_(0)                                          /* (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C0 Position */
#define ISI_R2Y_SET0_C0_Msk                   (_UINT32_(0x7F) << ISI_R2Y_SET0_C0_Pos)              /* (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C0 Mask */
#define ISI_R2Y_SET0_C0(value)                (ISI_R2Y_SET0_C0_Msk & (_UINT32_(value) << ISI_R2Y_SET0_C0_Pos)) /* Assignment of value for C0 in the ISI_R2Y_SET0 register */
#define ISI_R2Y_SET0_C1_Pos                   _UINT32_(8)                                          /* (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C1 Position */
#define ISI_R2Y_SET0_C1_Msk                   (_UINT32_(0x7F) << ISI_R2Y_SET0_C1_Pos)              /* (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C1 Mask */
#define ISI_R2Y_SET0_C1(value)                (ISI_R2Y_SET0_C1_Msk & (_UINT32_(value) << ISI_R2Y_SET0_C1_Pos)) /* Assignment of value for C1 in the ISI_R2Y_SET0 register */
#define ISI_R2Y_SET0_C2_Pos                   _UINT32_(16)                                         /* (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C2 Position */
#define ISI_R2Y_SET0_C2_Msk                   (_UINT32_(0x7F) << ISI_R2Y_SET0_C2_Pos)              /* (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C2 Mask */
#define ISI_R2Y_SET0_C2(value)                (ISI_R2Y_SET0_C2_Msk & (_UINT32_(value) << ISI_R2Y_SET0_C2_Pos)) /* Assignment of value for C2 in the ISI_R2Y_SET0 register */
#define ISI_R2Y_SET0_Roff_Pos                 _UINT32_(24)                                         /* (ISI_R2Y_SET0) Color Space Conversion Red Component Offset Position */
#define ISI_R2Y_SET0_Roff_Msk                 (_UINT32_(0x1) << ISI_R2Y_SET0_Roff_Pos)             /* (ISI_R2Y_SET0) Color Space Conversion Red Component Offset Mask */
#define ISI_R2Y_SET0_Roff(value)              (ISI_R2Y_SET0_Roff_Msk & (_UINT32_(value) << ISI_R2Y_SET0_Roff_Pos)) /* Assignment of value for Roff in the ISI_R2Y_SET0 register */
#define ISI_R2Y_SET0_Msk                      _UINT32_(0x017F7F7F)                                 /* (ISI_R2Y_SET0) Register Mask  */


/* -------- ISI_R2Y_SET1 : (ISI Offset: 0x1C) (R/W 32) ISI Color Space Conversion RGB To YCrCb Set 1 Register -------- */
#define ISI_R2Y_SET1_C3_Pos                   _UINT32_(0)                                          /* (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C3 Position */
#define ISI_R2Y_SET1_C3_Msk                   (_UINT32_(0x7F) << ISI_R2Y_SET1_C3_Pos)              /* (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C3 Mask */
#define ISI_R2Y_SET1_C3(value)                (ISI_R2Y_SET1_C3_Msk & (_UINT32_(value) << ISI_R2Y_SET1_C3_Pos)) /* Assignment of value for C3 in the ISI_R2Y_SET1 register */
#define ISI_R2Y_SET1_C4_Pos                   _UINT32_(8)                                          /* (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C4 Position */
#define ISI_R2Y_SET1_C4_Msk                   (_UINT32_(0x7F) << ISI_R2Y_SET1_C4_Pos)              /* (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C4 Mask */
#define ISI_R2Y_SET1_C4(value)                (ISI_R2Y_SET1_C4_Msk & (_UINT32_(value) << ISI_R2Y_SET1_C4_Pos)) /* Assignment of value for C4 in the ISI_R2Y_SET1 register */
#define ISI_R2Y_SET1_C5_Pos                   _UINT32_(16)                                         /* (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C5 Position */
#define ISI_R2Y_SET1_C5_Msk                   (_UINT32_(0x7F) << ISI_R2Y_SET1_C5_Pos)              /* (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C5 Mask */
#define ISI_R2Y_SET1_C5(value)                (ISI_R2Y_SET1_C5_Msk & (_UINT32_(value) << ISI_R2Y_SET1_C5_Pos)) /* Assignment of value for C5 in the ISI_R2Y_SET1 register */
#define ISI_R2Y_SET1_Goff_Pos                 _UINT32_(24)                                         /* (ISI_R2Y_SET1) Color Space Conversion Green Component Offset Position */
#define ISI_R2Y_SET1_Goff_Msk                 (_UINT32_(0x1) << ISI_R2Y_SET1_Goff_Pos)             /* (ISI_R2Y_SET1) Color Space Conversion Green Component Offset Mask */
#define ISI_R2Y_SET1_Goff(value)              (ISI_R2Y_SET1_Goff_Msk & (_UINT32_(value) << ISI_R2Y_SET1_Goff_Pos)) /* Assignment of value for Goff in the ISI_R2Y_SET1 register */
#define ISI_R2Y_SET1_Msk                      _UINT32_(0x017F7F7F)                                 /* (ISI_R2Y_SET1) Register Mask  */


/* -------- ISI_R2Y_SET2 : (ISI Offset: 0x20) (R/W 32) ISI Color Space Conversion RGB To YCrCb Set 2 Register -------- */
#define ISI_R2Y_SET2_C6_Pos                   _UINT32_(0)                                          /* (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C6 Position */
#define ISI_R2Y_SET2_C6_Msk                   (_UINT32_(0x7F) << ISI_R2Y_SET2_C6_Pos)              /* (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C6 Mask */
#define ISI_R2Y_SET2_C6(value)                (ISI_R2Y_SET2_C6_Msk & (_UINT32_(value) << ISI_R2Y_SET2_C6_Pos)) /* Assignment of value for C6 in the ISI_R2Y_SET2 register */
#define ISI_R2Y_SET2_C7_Pos                   _UINT32_(8)                                          /* (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C7 Position */
#define ISI_R2Y_SET2_C7_Msk                   (_UINT32_(0x7F) << ISI_R2Y_SET2_C7_Pos)              /* (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C7 Mask */
#define ISI_R2Y_SET2_C7(value)                (ISI_R2Y_SET2_C7_Msk & (_UINT32_(value) << ISI_R2Y_SET2_C7_Pos)) /* Assignment of value for C7 in the ISI_R2Y_SET2 register */
#define ISI_R2Y_SET2_C8_Pos                   _UINT32_(16)                                         /* (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C8 Position */
#define ISI_R2Y_SET2_C8_Msk                   (_UINT32_(0x7F) << ISI_R2Y_SET2_C8_Pos)              /* (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C8 Mask */
#define ISI_R2Y_SET2_C8(value)                (ISI_R2Y_SET2_C8_Msk & (_UINT32_(value) << ISI_R2Y_SET2_C8_Pos)) /* Assignment of value for C8 in the ISI_R2Y_SET2 register */
#define ISI_R2Y_SET2_Boff_Pos                 _UINT32_(24)                                         /* (ISI_R2Y_SET2) Color Space Conversion Blue Component Offset Position */
#define ISI_R2Y_SET2_Boff_Msk                 (_UINT32_(0x1) << ISI_R2Y_SET2_Boff_Pos)             /* (ISI_R2Y_SET2) Color Space Conversion Blue Component Offset Mask */
#define ISI_R2Y_SET2_Boff(value)              (ISI_R2Y_SET2_Boff_Msk & (_UINT32_(value) << ISI_R2Y_SET2_Boff_Pos)) /* Assignment of value for Boff in the ISI_R2Y_SET2 register */
#define ISI_R2Y_SET2_Msk                      _UINT32_(0x017F7F7F)                                 /* (ISI_R2Y_SET2) Register Mask  */


/* -------- ISI_CR : (ISI Offset: 0x24) ( /W 32) ISI Control Register -------- */
#define ISI_CR_ISI_EN_Pos                     _UINT32_(0)                                          /* (ISI_CR) ISI Module Enable Request Position */
#define ISI_CR_ISI_EN_Msk                     (_UINT32_(0x1) << ISI_CR_ISI_EN_Pos)                 /* (ISI_CR) ISI Module Enable Request Mask */
#define ISI_CR_ISI_EN(value)                  (ISI_CR_ISI_EN_Msk & (_UINT32_(value) << ISI_CR_ISI_EN_Pos)) /* Assignment of value for ISI_EN in the ISI_CR register */
#define ISI_CR_ISI_DIS_Pos                    _UINT32_(1)                                          /* (ISI_CR) ISI Module Disable Request Position */
#define ISI_CR_ISI_DIS_Msk                    (_UINT32_(0x1) << ISI_CR_ISI_DIS_Pos)                /* (ISI_CR) ISI Module Disable Request Mask */
#define ISI_CR_ISI_DIS(value)                 (ISI_CR_ISI_DIS_Msk & (_UINT32_(value) << ISI_CR_ISI_DIS_Pos)) /* Assignment of value for ISI_DIS in the ISI_CR register */
#define ISI_CR_ISI_SRST_Pos                   _UINT32_(2)                                          /* (ISI_CR) ISI Software Reset Request Position */
#define ISI_CR_ISI_SRST_Msk                   (_UINT32_(0x1) << ISI_CR_ISI_SRST_Pos)               /* (ISI_CR) ISI Software Reset Request Mask */
#define ISI_CR_ISI_SRST(value)                (ISI_CR_ISI_SRST_Msk & (_UINT32_(value) << ISI_CR_ISI_SRST_Pos)) /* Assignment of value for ISI_SRST in the ISI_CR register */
#define ISI_CR_ISI_CDC_Pos                    _UINT32_(8)                                          /* (ISI_CR) ISI Codec Request Position */
#define ISI_CR_ISI_CDC_Msk                    (_UINT32_(0x1) << ISI_CR_ISI_CDC_Pos)                /* (ISI_CR) ISI Codec Request Mask */
#define ISI_CR_ISI_CDC(value)                 (ISI_CR_ISI_CDC_Msk & (_UINT32_(value) << ISI_CR_ISI_CDC_Pos)) /* Assignment of value for ISI_CDC in the ISI_CR register */
#define ISI_CR_Msk                            _UINT32_(0x00000107)                                 /* (ISI_CR) Register Mask  */


